Autodesk.Revit.DB.UpdaterId.#ctor(Autodesk.Revit.DB.AddInId,System.Guid)
creates an instance of UpdaterId for given AddInId and a given GUID value
addInId:
Id of addin that registers an Updater
val:
a stable GUID identifying the Updater within addin
Throws Autodesk.Revit.Exceptions.ArgumentException:
addInId is not valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.UpdaterId
A unique identifier of an Updater
Remarks:
UpdaterId used as a key to register and unregister Updaters and UpdateTriggers in Revit application
UpdaterId needs to be a stable identity for a given updater.
Since:
2011